doom/myconfig.org
#+title: My Emacs Configuration
#+options: num:nil
#+tags: config
#+todo: TODO DONE
#+tags: { FIX(f) }
* Core packages & setup
** Indentations
#+BEGIN_SRC emacs-lisp
(global-aggressive-indent-mode 1)
(add-to-list 'aggressive-indent-excluded-modes 'html-mode)
(setq-default tab-width 4)
#+END_SRC
* Appearance
#+BEGIN_SRC emacs-lisp
(setq doom-theme 'doom-oceanic-next)
#+END_SRC
* Module configuration
** snippets
#+begin_src emacs-lisp
#+end_src
** org configuration
*** set default directory
#+BEGIN_SRC emacs-lisp
(setq org-directory "~/Documents/")
#+END_SRC
*** configure todos
#+BEGIN_SRC emacs-lisp
(setq org-todo-keywords
  '((sequence "TODO" "IN-PROGRESS" "WAITING" "|" "DONE")))
#+END_SRC
*** configure tags
#+begin_src emacs-lisp
;;(setq org-tag-alist '(("@work" . ?w) ("@home" . ?h) ("laptop" . ?l)))
#+end_src
*** configure capture
#+BEGIN_SRC emacs-lisp
(setq org-default-notes-file (concat org-directory "~/Documents/notes.org"))
#+END_SRC
*** configure templates
("1" "title" type (target) :properties "template")
List of available properties: https://orgmode.org/manual/Template-elements.html
#+BEGIN_SRC emacs-lisp
(after! org
  (setq org-capture-templates
        (setq org-capture-templates
                '(("t" "Todo" entry (file+headline "~/Documents/todo.org" "Tasks")
                   "* TODO %?\n  %u %a"
                   :empty-lines 0
                   :kill-buffer t)
                  ("j" "Journal" entry (file+datetree "~/Documents/journal.org")
                   "* %?\nEntered on %U\n  >%i\n  %a"
                   :empty-lines 0
                   :kill-buffer t)
                  ("s" "Shortcut" table-line (file+headline "~/Documents/ref-tables.org" "keybinds")
                   "|%?| | %^{system|Emacs|niri} |")
    )))
)
;(setq org-capture-templates-contexts
;      '(("c" ((in-mode . "message-mode")))
;        ("d" (my-context-function (in-mode . "org-mode")))
;       ))
#+END_SRC
** evil configuration
#+BEGIN_SRC emacs-lisp
(setq evil-normal-state-cursor '(box "#6699CC"))
(setq evil-insert-state-cursor '(bar "yellow"))
(setq evil-visual-state-cursor 'box)
(setq evil-replace-state-cursor '(hollow "yellow"))
#+END_SRC
* Keybinds
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-t") #'treemacs)
#+END_SRC
** org-mode keybinds
